bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
        for (uint8_t i = 0; i < HWZC_VERIFY_READS; i++) {
            /* Wait one ADC conversion period FIRST so the read sees a fresh
             * sample (not the comparator-trigger sample). 80 NOPs ≈ 800 ns
             * + read/branch ≈ 1 µs total at SCCP3 = 1 MHz. */
            for (uint8_t j = 0; j < 80; j++) __asm__ volatile("nop");

            uint16_t adc_now = (v_core == 1) ? AD1CH5DATA : AD2CH1DATA;
            bool crossed = v_rising ? (adc_now > v_thresh) : (adc_now < v_thresh);
            if (!crossed) {
                /* Phantom — BEMF returned to original side within one sample
                 * period. Re-arm comparator, keep timeout running. */
                pData->hwzc.noiseRejectCount++;
                pData->hwzc.rejectsThisStep++;
                HAL_ADC_ClearComparatorFlag(v_core);
                HAL_ADC_EnableComparatorIE(v_core);
                return;
            }
        }
    }
#endif

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI mode: ZC has passed noise rejection. Just record the
     * timestamp and let the autonomous SCCP1 timer (set in OnBlankingExpired
     * to fire at lastCommStamp + timerPeriod) drive commutation.
     * HWZC_OnPiPeriodExpired will run the PI math using this capture.
     *
     * Comparator IE is disabled — this is the "one accept per sector" rule
     * (matches ATA's ProcessBemfSample one-shot semantic). Further ZC IRQs
     * in this sector would be phantoms or chatter; let them sleep until
     * the next OnBlankingExpired re-enables. */
    pData->hwzc.lastCaptureHR = zcStamp;
    pData->hwzc.captureValid  = true;
    pData->hwzc.lastZcStamp   = zcStamp;   /* keep legacy field for diag */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;
    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
    return;
#endif

    /* Cancel the timeout timer */
    HAL_SCCP1_Stop();

    /* Update stepPeriodHR with seqlock (Rule 13).
     * Guard 1: only update IIR when this ZC follows exactly one commutation
     * (consecutive detection). Multi-step intervals include timeout periods,
     * not real motor periods — they contaminate the estimator.
     * Guard 2: freeze IIR for the first N ZCs after HWZC_Enable. A single
     * phantom or mistimed ZC during morph handoff used to pull stepPeriodHR
     * rapidly toward floor (observed in ~50% of morph attempts). Holding the
     * seeded stepPeriodHR for a few cycles lets the motor lock in at the
     * morph-exit rate before the IIR starts adapting. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT)
    {
        pData->hwzc.writeSeq++;  /* odd = write in progress */
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;  /* even = stable */
    }
    pData->hwzc.stepsSinceLastHwZc = 0;

    pData->hwzc.lastZcStamp = zcStamp;

    /* Track consecutive good ZCs (saturate to prevent stale re-seed) */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Optimization B: use commDelay pre-computed by OnBlankingExpired.
     * Saves ~1.5 µs of division/interpolation inside the latency-critical ISR.
     * The cached value reflects stepPeriodHR at blanking-expiry, which is the
     * same IIR-filtered value used here except for the one IIR update above
     * (25% weight on the just-measured interval — negligible at steady state). */
    uint32_t commDelay = pData->hwzc.cachedCommDelay;
    if (commDelay < 10) commDelay = 10;

    /* Gate comparator OFF during COMM_PENDING. After accepting a real ZC, the
     * BEMF stays on the crossed side until the next commutation — any further
     * comparator IRQs in this window come from PWM ripple oscillating the
     * signal back across threshold, body-diode recovery, or cross-coupling,
     * and waste ~5µs of ISR time each (verify reads + interval check + re-arm)
     * for no useful purpose. At high RPM these spurious ISRs starve the 24kHz
     * ADC ISR, delaying threshold updates and degrading the NEXT sector's
     * detection. Re-enabled in OnBlankingExpired of next step. */
    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_COMM_PENDING;

    HAL_SCCP1_StartOneShot(commDelay);
}

/**
 * @brief Commutation deadline reached — advance to next step.
 * Called from SCCP1 ISR when phase == HWZC_COMM_PENDING.
 */
void HWZC_OnCommDeadline(volatile GARUDA_DATA_T *pData)
{
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;  /* 16-bit, atomic for observer (Rule 13) */
    pData->hwzc.stepsSinceLastHwZc++;

    /* Set up ZC detection for the new step */
    HWZC_OnCommutation(pData);
}

#if FEATURE_HWZC_SECTOR_PI
/**
 * @brief Sector PI period expired — run PI math and commutate.
 *
 * Called from SCCP1 ISR (via _CCT1Interrupt) when phase == HWZC_WATCHING
 * AND FEATURE_HWZC_SECTOR_PI=1. In reactive mode this slot is HWZC_OnTimeout
 * (a missed-ZC handler); in PI mode it is the AUTONOMOUS commutation event.
 *
 * Algorithm (ported from PATA6847 sector_pi.c at the 225k milestone):
 *   1. Compute setValue from current advance schedule and timerPeriod.
 *      setValue = (advancePlus30Fp8 × timerPeriod) >> 8
 *      At lock, capValue ≈ setValue. With filter comp already aligning
 *      capValue with the true rotor ZC, the formula assumes:
 *          ZC happens at (advance + 30°)/60° of the inter-commutation
 *          interval, since commutation fires `advance°` early relative
 *          to the next rotor sector boundary.
 *   2. delta = capValue − setValue (signed phase error)
 *   3. delta = clamp(delta, ±timerPeriod >> CLAMP_SHIFT)
 *   4. integrator += delta >> KI_SHIFT
 *   5. timerPeriod = integrator + (delta >> KP_SHIFT)
 *   6. Advance commutation step, re-arm next sector.
 *
 * On capture-miss: skip PI update (timerPeriod unchanged), still commutate.
 * The motor is more robust to a missed sample than to a wrong correction.
 */
#if FEATURE_PLL_STARTUP
/* PLL-from-align blind startup tick (task #10, twin-prototyped).
 * Runs INSTEAD of the PI while pllStartActive: commutates on an
 * accelerating commanded schedule, consumes captures (discarding them
 * below the BEMF floor — phantom-proof), and hands over to the normal
 * PI after PLL_START_SYNC_CAPS consecutive plausible captures. */
static void HWZC_PllStartTick(volatile GARUDA_DATA_T *pData)
{
    uint32_t T = pData->hwzc.timerPeriod;
    uint32_t eCmd = (T > 0) ? HWZC_TICKS_TO_ERPM(T) : PLL_START_ERPM0;

    /* Capture floor: never trust captures below the active profile's HWZC
     * crossover (per-motor BEMF detectability), whichever is higher. */
    uint32_t pllFloorErpm = PLL_START_CAPTURE_FLOOR_ERPM;
    if (RT_HWZC_CROSSOVER_ERPM > pllFloorErpm)
        pllFloorErpm = RT_HWZC_CROSSOVER_ERPM;
    if (pData->hwzc.captureValid) {
        if (eCmd >= pllFloorErpm) {
            uint32_t cap = pData->hwzc.lastCaptureHR
                         - pData->hwzc.lastCommStamp;   /* modular */
            /* CONSISTENCY gate (twin iteration #5). A locked rotor puts the
             * ZC at the SAME sector fraction every sector; phantoms land
             * randomly. The old absolute window (0.30T..0.75T) was fragile:
             * load angle / timing advance / RC filter lag all shift the
             * true crossing (twin saw a fully-locked rotor pinned at the
             * blanking edge ~0.14T and never synced). Gate instead on
             * sector-plausible (T/8..7T/8, outside blanking, inside sector)
             * AND stable vs the previous capture (|Δ| < T/4 — wide enough
             * for the rising/falling polarity lag split, narrow enough that
             * a 6-streak of random phantoms is ~3% likely). */
            uint32_t prevCap = pData->hwzc.pllPrevCap;
            pData->hwzc.pllPrevCap = cap;
            if (cap > (T >> 3) && cap < (T - (T >> 3))) {
                uint32_t d = (cap > prevCap) ? cap - prevCap : prevCap - cap;
                if (prevCap != 0u && d < (T >> 2)) {
                    if (++pData->hwzc.pllStartGood >= PLL_START_SYNC_CAPS) {
                        /* HANDOVER: declared synced; leave captureValid set
                         * so the normal PI consumes THIS capture next event. */
                        pData->hwzc.pllStartActive = 0;
                        pData->timing.zcSynced = true;
                        pData->timing.goodZcCount = (uint16_t)RT_ZC_SYNC_THRESHOLD;
                        goto pll_commutate;
                    }
                } else {
                    pData->hwzc.pllStartGood = 1;   /* plausible, streak restarts */
                }
            } else {
                pData->hwzc.pllStartGood = 0;
                pData->hwzc.pllPrevCap = 0;
            }
        }
        pData->hwzc.captureValid = false;   /* consume in blind phase */
    } else if (eCmd >= pllFloorErpm
               && pData->hwzc.pllStartGood > 0) {
        pData->hwzc.pllStartGood = 0;       /* silence resets the streak */
        pData->hwzc.pllPrevCap = 0;
    }

    /* blind accel schedule toward the target */
    if (eCmd < PLL_START_TARGET_ERPM) {
        /* Sector time in seconds = T / SCCP_CLOCK_HZ (HR tick = 10 ns).
         * NOT /1e9 — that unit slip made the schedule accelerate exactly
         * 10× slower than commanded (twin iteration #4 root cause). */
        uint32_t eNew = eCmd + (uint32_t)(((uint64_t)PLL_START_ACCEL_ERPM_PER_S
                                           * T) / (uint64_t)SCCP_CLOCK_HZ);
        if (eNew <= eCmd) eNew = eCmd + 1u;
        if (eNew > PLL_START_TARGET_ERPM) eNew = PLL_START_TARGET_ERPM;
        T = HWZC_ERPM_TO_TICKS(eNew);       /* symmetric: 1e9/e */
        pData->hwzc.timerPeriod = T;
        pData->hwzc.integrator  = (int32_t)T;
#if FEATURE_HWZC_PI_FLOAT
        pData->hwzc.integratorF = (float)T;
#endif
        pData->hwzc.writeSeq++;             /* Rule 13 seqlock */
        pData->hwzc.stepPeriodHR = T;
        pData->hwzc.writeSeq++;
    }

pll_commutate:
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;
    pData->hwzc.stepsSinceLastHwZc = 0;
    HWZC_OnCommutation(pData);
}
#endif /* FEATURE_PLL_STARTUP */

void HWZC_OnPiPeriodExpired(volatile GARUDA_DATA_T *pData)
{
#if FEATURE_PLL_STARTUP
    if (pData->hwzc.pllStartActive) { HWZC_PllStartTick(pData); return; }
#endif
    /* Compute current torque-advance (interpolated from RT_TIMING_ADV_MAX_DEG)
     * — same schedule the reactive path uses, just consumed differently. */
    uint16_t advDeg;
    uint32_t T = pData->hwzc.timerPeriod;
#if FEATURE_TIMING_ADVANCE
    uint32_t eRPM = (T > 0) ? HWZC_TICKS_TO_ERPM(T) : 0;
    if (eRPM <= RT_RAMP_TARGET_ERPM)
        advDeg = TIMING_ADVANCE_MIN_DEG;
    else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
        advDeg = RT_TIMING_ADV_MAX_DEG;
    else {
        uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
        uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
        advDeg = TIMING_ADVANCE_MIN_DEG +
            (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                       * pos / range);
    }
#else
    advDeg = 0;
#endif
    pData->hwzc.dbgAdvanceDeg = advDeg;

